Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.ExcludeTypeEnum Enumeration
 The different ways to exclude reinforcing bars from the spacing.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ExcludeTypeEnum
Public Enumeration ExcludeTypeEnum
Members
Member name | Value | Description
EXCLUDE_TYPE_NONE | 1 |  All the reinforcing bars are included.
EXCLUDE_TYPE_FIRST | 2 |  The first reinforcing bar is not to be created to the spacing.
EXCLUDE_TYPE_LAST | 3 |  The last reinforcing bar is not to be created to the spacing.
EXCLUDE_TYPE_BOTH | 4 |  The first and last reinforcing bars are not to be created to the spacing.
See Also
Reference
Tekla.Structures.Model Namespace